Revit 2027 API
ExtendedPropertiesBindings.AddCategory Method
 Adds a category id to the bindings.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCategory(
	ForgeTypeId categoryId
)
Public Sub AddCategory (
	categoryId As ForgeTypeId
)
public:
void AddCategory(
	ForgeTypeId^ categoryId
)
member AddCategory :
        categoryId : ForgeTypeId -> unit
Parameters
categoryId ForgeTypeId
 Identifier of the category.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace